/*
 * Copyright 2025 Google LLC
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     https://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

rule PROMPTFLUX_LOG_FILE_CREATION_elevate2025 {
  meta:
    author = "Google Cloud Security"
    description = "Detects the creation of a log file by the PROMPTFLUX malware, which indicates experimentation with LLMs for dynamic obfuscation."
    rule_id = "mr_b8a7b8e9-9b3a-4e1a-8f0a-9a8b7c6d5e4f"
    rule_name = "PROMPTFLUX Log File Creation"
    mitre_attack_tactic = "TA0005"
    mitre_attack_technique = "T1027"
    type = "alert"
    data_source = "microsoft sysmon, microsoft windows events"
    severity = "Medium"
    priority = "Medium"

  events:
    $e.metadata.event_type = "FILE_CREATION"
    re.regex($e.target.file.full_path, `.*\\Temp\\thinking_robot_log\.txt$`) nocase

  condition:
    $e
}
